#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
random_string.bucket_suffix: Refreshing state... [id=w6gxq5k7]
aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-east-1:743794601996:certificate/c5b864e5-c9d4-4b0b-89de-105b125d3e7d]
data.aws_cloudfront_response_headers_policy.security_headers: Reading...
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Reading...
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
data.aws_caller_identity.current: Reading...
aws_kms_key.ssm_key: Refreshing state... [id=cdfc2466-cc91-4fae-997b-ff692883f759]
aws_cloudfront_origin_access_control.error_pages: Refreshing state... [id=E3PG78VVJ3MX28]
aws_kms_key.s3_key: Refreshing state... [id=91695a84-8e16-4400-be5c-3574312f616f]
aws_s3_bucket.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_s3_bucket.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_route53_zone.main: Reading...
aws_cloudfront_origin_access_control.website: Refreshing state... [id=E1XWWA1OOWZXM0]
aws_kms_alias.s3_key_alias: Refreshing state... [id=alias/app-16-encrypt-s3]
aws_cloudfront_response_headers_policy.security_headers: Refreshing state... [id=926c4778-6952-4270-a9d7-c0cee743e1a6]
data.aws_iam_policy_document.s3_key_policy: Reading...
data.aws_iam_policy_document.s3_key_policy: Read complete after 0s [id=1948157099]
data.aws_iam_policy_document.ssm_key_policy: Reading...
data.aws_iam_policy_document.ssm_key_policy: Read complete after 0s [id=3761543487]
aws_kms_alias.ssm_key_alias: Refreshing state... [id=alias/app-16-encrypt-ssm]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
aws_kms_key_policy.s3_key: Refreshing state... [id=91695a84-8e16-4400-be5c-3574312f616f]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_kms_key_policy.ssm_key: Refreshing state... [id=cdfc2466-cc91-4fae-997b-ff692883f759]
data.aws_cloudfront_response_headers_policy.security_headers: Read complete after 0s [id=67f7725c-6f97-4210-82d7-5512b31e9d03]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_s3_bucket_website_configuration.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_s3_bucket_server_side_encryption_configuration.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_s3_bucket_versioning.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_s3_bucket_public_access_block.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
aws_s3_bucket_server_side_encryption_configuration.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
aws_s3_bucket_logging.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_s3_object.error_500: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7/error-pages/500.html]
aws_s3_bucket_lifecycle_configuration.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
aws_s3_bucket_versioning.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
aws_s3_object.error_404: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7/error-pages/404.html]
aws_s3_bucket_ownership_controls.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
aws_s3_bucket_acl.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7,private]
data.aws_route53_zone.main: Read complete after 1s [id=Z0548901SQXAMNGNLB2Z]
aws_route53_record.cert_validation["kunduso.com"]: Refreshing state... [id=Z0548901SQXAMNGNLB2Z__373a28aa8a2669626e6595d0ca44d8d3.kunduso.com._CNAME]
aws_route53_record.cert_validation["www.kunduso.com"]: Refreshing state... [id=Z0548901SQXAMNGNLB2Z__ac51999ee374a398c1177b75db8a7bd5.www.kunduso.com._CNAME]
aws_acm_certificate_validation.website: Refreshing state... [id=2026-01-16 01:37:29.376 +0000 UTC]
aws_cloudfront_distribution.website: Refreshing state... [id=E33JMY4LM0BAJB]
aws_route53_record.root: Refreshing state... [id=Z0548901SQXAMNGNLB2Z_kunduso.com_A]
aws_ssm_parameter.infra_output: Refreshing state... [id=/app-16/output]
aws_s3_bucket_policy.cloudfront_ops: Refreshing state... [id=app-16-cloudfront-ops-w6gxq5k7]
aws_s3_bucket_policy.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]
aws_route53_record.www: Refreshing state... [id=Z0548901SQXAMNGNLB2Z_www.kunduso.com_A]
aws_s3_bucket_lifecycle_configuration.website: Refreshing state... [id=app-16-static-website-w6gxq5k7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudfront_ops_bucket_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cloudfront_ops_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::app-16-cloudfront-ops-w6gxq5k7/error-pages/*",
            ]
          + sid       = "AllowCloudFrontServicePrincipal"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::743794601996:distribution/E33JMY4LM0BAJB",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::app-16-cloudfront-ops-w6gxq5k7/logs/*",
            ]
          + sid       = "AllowCloudFrontLogging"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::743794601996:distribution/E33JMY4LM0BAJB",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.s3_bucket_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::app-16-static-website-w6gxq5k7/*",
            ]
          + sid       = "AllowCloudFrontServicePrincipal"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::743794601996:distribution/E33JMY4LM0BAJB",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website" {
        id                              = "E33JMY4LM0BAJB"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ allowed_methods            = [
              - "DELETE",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
                # (2 unchanged elements hidden)
            ]
          ~ response_headers_policy_id = "926c4778-6952-4270-a9d7-c0cee743e1a6" -> "67f7725c-6f97-4210-82d7-5512b31e9d03"
            # (14 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.cloudfront_ops will be updated in-place
  ~ resource "aws_s3_bucket_policy" "cloudfront_ops" {
        id     = "app-16-cloudfront-ops-w6gxq5k7"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::743794601996:distribution/E33JMY4LM0BAJB"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::app-16-cloudfront-ops-w6gxq5k7/error-pages/*"
                      - Sid       = "AllowCloudFrontServicePrincipal"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::743794601996:distribution/E33JMY4LM0BAJB"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::app-16-cloudfront-ops-w6gxq5k7/logs/*"
                      - Sid       = "AllowCloudFrontLogging"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.website will be updated in-place
  ~ resource "aws_s3_bucket_policy" "website" {
        id     = "app-16-static-website-w6gxq5k7"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::743794601996:distribution/E33JMY4LM0BAJB"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::app-16-static-website-w6gxq5k7/*"
                      - Sid       = "AllowCloudFrontServicePrincipal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*